app/views/books/index.html.erb

SELECT "books".* FROM "books"
---
					<td>
					  コメント数:<%= book.book_comments.count %></a>