app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "a"], ["user_id", 1], ["book_id", 4], ["created_at", "2020-08-20 13:12:09.894213"], ["updated_at", "2020-08-20 13:12:09.894213"]]
---
  def create
    @book = Book.find(params[:book_id])
    @comment = current_user.book_comments.new(book_comment_params)
    @comment.book_id = @book.id
    @comment.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["user_id", 1], ["id", 18], ["book_id", 4], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? AND "books"."book_id" = ? LIMIT ?  [["id", 1], ["book_id", "4"], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 18]]
---
  def destroy
    @book = Book.find(params[:book_id])
    book_comment = current_user.book_comments.find_by(id: params[:id], book_id: @book.id)
    book_comment.destroy