app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "アイアンマン"], ["body", "マーベル作品"], ["user_id", 1], ["created_at", "2020-08-23 10:12:32.166163"], ["updated_at", "2020-08-23 10:12:32.166163"]]
SELECT "books".* FROM "books"

  def ensure_correct_book
      book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]