app/controllers/search_controller.rb

  def search
    @range = params[:range]
    search = params[:search]
    word = params[:word]
      if @range == '1'
         @user = User.search(search,word)
      else
      	 @book = Book.search(search,word)
---
SELECT "users".* FROM "users" WHERE (name LIKE'taka%')
SELECT "books".* FROM "books" WHERE (title LIKE'taka%')